# CalculatedHeatingLoad Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Zone..::..CalculatedHeatingLoad Property
Zone Class See Also
---
Get the Calculated Heating Load of the Zone.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public double CalculatedHeatingLoad { get; }
```

Visual Basic
---
```text
Public ReadOnly Property CalculatedHeatingLoad As Double
	Get
```

Visual C++
---
```text
public:
property double CalculatedHeatingLoad {
	double get ();
}
```

# Remarks
This property is used to get the Calculated Heating Load of the Zone.
# See Also
Zone Class
Autodesk.Revit.DB.Mechanical Namespace